In [1]:
import pandas as pd

In [18]:
df = pd.read_csv ('datasets/kc_house_data.csv')
pd.set_option('display.float_format',lambda x: '%.2f' % x)

In [19]:
df[['price', 'bathrooms', 'bedrooms']].groupby(['bathrooms', 'bedrooms']).mean().reset_index()

     bathrooms  bedrooms      price
0         0.00         0  520371.43
1         0.00         1  279666.67
2         0.50         1  255000.00
3         0.50         2  191000.00
4         0.50         4  312500.00
..         ...       ...        ...
139       6.75         7  800000.00
140       7.50         9  450000.00
141       7.75         6 6885000.00
142       8.00         6 7700000.00
143       8.00         7 2280000.00

[144 rows x 3 columns]